tests/k6/results/avant_correctifs_20260921/nominal_20260921_024024.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/mg/mailguard/tests/k6/nominal.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 02/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 02/50 VUs  0m00.9s/5m00.0s

running (0m01.9s), 04/50 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 04/50 VUs  0m01.9s/5m00.0s

running (0m02.9s), 05/50 VUs, 4 complete and 0 interrupted iterations
default   [   1% ] 05/50 VUs  0m02.9s/5m00.0s

running (0m03.9s), 07/50 VUs, 9 complete and 0 interrupted iterations
default   [   1% ] 07/50 VUs  0m03.9s/5m00.0s

running (0m04.9s), 08/50 VUs, 13 complete and 0 interrupted iterations
default   [   2% ] 08/50 VUs  0m04.9s/5m00.0s

running (0m05.9s), 10/50 VUs, 20 complete and 0 interrupted iterations
default   [   2% ] 10/50 VUs  0m05.9s/5m00.0s

running (0m06.9s), 12/50 VUs, 29 complete and 0 interrupted iterations
default   [   2% ] 12/50 VUs  0m06.9s/5m00.0s

running (0m07.9s), 13/50 VUs, 41 complete and 0 interrupted iterations
default   [   3% ] 13/50 VUs  0m07.9s/5m00.0s

running (0m08.9s), 15/50 VUs, 48 complete and 0 interrupted iterations
default   [   3% ] 15/50 VUs  0m08.9s/5m00.0s

running (0m09.9s), 17/50 VUs, 62 complete and 0 interrupted iterations
default   [   3% ] 17/50 VUs  0m09.9s/5m00.0s

running (0m10.9s), 18/50 VUs, 76 complete and 0 interrupted iterations
default   [   4% ] 18/50 VUs  0m10.9s/5m00.0s

running (0m11.9s), 20/50 VUs, 89 complete and 0 interrupted iterations
default   [   4% ] 20/50 VUs  0m11.9s/5m00.0s

running (0m12.9s), 21/50 VUs, 106 complete and 0 interrupted iterations
default   [   4% ] 21/50 VUs  0m12.9s/5m00.0s

running (0m13.9s), 23/50 VUs, 118 complete and 0 interrupted iterations
default   [   5% ] 23/50 VUs  0m13.9s/5m00.0s

running (0m14.9s), 25/50 VUs, 137 complete and 0 interrupted iterations
default   [   5% ] 25/50 VUs  0m14.9s/5m00.0s

running (0m15.9s), 26/50 VUs, 160 complete and 0 interrupted iterations
default   [   5% ] 26/50 VUs  0m15.9s/5m00.0s

running (0m16.9s), 28/50 VUs, 176 complete and 0 interrupted iterations
default   [   6% ] 28/50 VUs  0m16.9s/5m00.0s

running (0m17.9s), 30/50 VUs, 195 complete and 0 interrupted iterations
default   [   6% ] 30/50 VUs  0m17.9s/5m00.0s

running (0m18.9s), 31/50 VUs, 207 complete and 0 interrupted iterations
default   [   6% ] 31/50 VUs  0m18.9s/5m00.0s

running (0m19.9s), 33/50 VUs, 224 complete and 0 interrupted iterations
default   [   7% ] 33/50 VUs  0m19.9s/5m00.0s

running (0m20.9s), 35/50 VUs, 246 complete and 0 interrupted iterations
default   [   7% ] 35/50 VUs  0m20.9s/5m00.0s

running (0m21.9s), 36/50 VUs, 266 complete and 0 interrupted iterations
default   [   7% ] 36/50 VUs  0m21.9s/5m00.0s

running (0m22.9s), 38/50 VUs, 279 complete and 0 interrupted iterations
default   [   8% ] 38/50 VUs  0m22.9s/5m00.0s

running (0m23.9s), 39/50 VUs, 304 complete and 0 interrupted iterations
default   [   8% ] 39/50 VUs  0m23.9s/5m00.0s

running (0m24.9s), 41/50 VUs, 331 complete and 0 interrupted iterations
default   [   8% ] 41/50 VUs  0m24.9s/5m00.0s

running (0m25.9s), 43/50 VUs, 361 complete and 0 interrupted iterations
default   [   9% ] 43/50 VUs  0m25.9s/5m00.0s

running (0m26.9s), 44/50 VUs, 385 complete and 0 interrupted iterations
default   [   9% ] 44/50 VUs  0m26.9s/5m00.0s

running (0m27.9s), 46/50 VUs, 418 complete and 0 interrupted iterations
default   [   9% ] 46/50 VUs  0m27.9s/5m00.0s

running (0m28.9s), 48/50 VUs, 450 complete and 0 interrupted iterations
default   [  10% ] 48/50 VUs  0m28.9s/5m00.0s

running (0m29.9s), 49/50 VUs, 482 complete and 0 interrupted iterations
default   [  10% ] 49/50 VUs  0m29.9s/5m00.0s

running (0m30.9s), 50/50 VUs, 509 complete and 0 interrupted iterations
default   [  10% ] 50/50 VUs  0m30.9s/5m00.0s

running (0m31.9s), 50/50 VUs, 546 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m31.9s/5m00.0s

running (0m32.9s), 50/50 VUs, 578 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m32.9s/5m00.0s

running (0m33.9s), 50/50 VUs, 609 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m33.9s/5m00.0s

running (0m34.9s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m34.9s/5m00.0s

running (0m35.9s), 50/50 VUs, 680 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m35.9s/5m00.0s

running (0m36.9s), 50/50 VUs, 704 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m36.9s/5m00.0s

running (0m37.9s), 50/50 VUs, 743 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m37.9s/5m00.0s

running (0m38.9s), 50/50 VUs, 766 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m38.9s/5m00.0s

running (0m39.9s), 50/50 VUs, 815 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m39.9s/5m00.0s

running (0m40.9s), 50/50 VUs, 844 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m40.9s/5m00.0s

running (0m41.9s), 50/50 VUs, 886 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m41.9s/5m00.0s

running (0m42.9s), 50/50 VUs, 924 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m42.9s/5m00.0s

running (0m43.9s), 50/50 VUs, 959 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m43.9s/5m00.0s

running (0m44.9s), 50/50 VUs, 996 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m44.9s/5m00.0s

running (0m45.9s), 50/50 VUs, 1016 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m45.9s/5m00.0s

running (0m46.9s), 50/50 VUs, 1048 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m46.9s/5m00.0s

running (0m47.9s), 50/50 VUs, 1077 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m47.9s/5m00.0s

running (0m48.9s), 50/50 VUs, 1109 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m48.9s/5m00.0s

running (0m49.9s), 50/50 VUs, 1140 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m49.9s/5m00.0s

running (0m50.9s), 50/50 VUs, 1175 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m50.9s/5m00.0s

running (0m51.9s), 50/50 VUs, 1215 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m51.9s/5m00.0s

running (0m52.9s), 50/50 VUs, 1245 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m52.9s/5m00.0s

running (0m53.9s), 50/50 VUs, 1289 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m53.9s/5m00.0s

running (0m54.9s), 50/50 VUs, 1317 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m54.9s/5m00.0s

running (0m55.9s), 50/50 VUs, 1360 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m55.9s/5m00.0s

running (0m56.9s), 50/50 VUs, 1394 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m56.9s/5m00.0s

running (0m57.9s), 50/50 VUs, 1439 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m57.9s/5m00.0s

running (0m58.9s), 50/50 VUs, 1481 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  0m58.9s/5m00.0s

running (0m59.9s), 50/50 VUs, 1513 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  0m59.9s/5m00.0s

running (1m00.9s), 50/50 VUs, 1547 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  1m00.9s/5m00.0s

running (1m01.9s), 50/50 VUs, 1571 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m01.9s/5m00.0s

running (1m02.9s), 50/50 VUs, 1619 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m02.9s/5m00.0s

running (1m03.9s), 50/50 VUs, 1664 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m03.9s/5m00.0s

running (1m04.9s), 50/50 VUs, 1690 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m04.9s/5m00.0s

running (1m05.9s), 50/50 VUs, 1736 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m05.9s/5m00.0s

running (1m06.9s), 50/50 VUs, 1773 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m06.9s/5m00.0s

running (1m07.9s), 50/50 VUs, 1796 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m07.9s/5m00.0s

running (1m08.9s), 50/50 VUs, 1832 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m08.9s/5m00.0s

running (1m09.9s), 50/50 VUs, 1858 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m09.9s/5m00.0s

running (1m10.9s), 50/50 VUs, 1890 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m10.9s/5m00.0s

running (1m11.9s), 50/50 VUs, 1920 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m11.9s/5m00.0s

running (1m12.9s), 50/50 VUs, 1965 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m12.9s/5m00.0s

running (1m13.9s), 50/50 VUs, 1989 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m13.9s/5m00.0s

running (1m14.9s), 50/50 VUs, 2023 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m14.9s/5m00.0s

running (1m15.9s), 50/50 VUs, 2037 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m15.9s/5m00.0s

running (1m16.9s), 50/50 VUs, 2072 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m16.9s/5m00.0s

running (1m17.9s), 50/50 VUs, 2108 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m17.9s/5m00.0s

running (1m18.9s), 50/50 VUs, 2138 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m18.9s/5m00.0s

running (1m20.1s), 50/50 VUs, 2182 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m20.1s/5m00.0s

running (1m20.9s), 50/50 VUs, 2209 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m20.9s/5m00.0s

running (1m21.9s), 50/50 VUs, 2234 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m21.9s/5m00.0s

running (1m22.9s), 50/50 VUs, 2258 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m22.9s/5m00.0s

running (1m23.9s), 50/50 VUs, 2295 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m23.9s/5m00.0s

running (1m24.9s), 50/50 VUs, 2314 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m24.9s/5m00.0s

running (1m25.9s), 50/50 VUs, 2343 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m25.9s/5m00.0s

running (1m26.9s), 50/50 VUs, 2376 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m26.9s/5m00.0s

running (1m27.9s), 50/50 VUs, 2403 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m27.9s/5m00.0s

running (1m28.9s), 50/50 VUs, 2440 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m28.9s/5m00.0s

running (1m29.9s), 50/50 VUs, 2459 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m29.9s/5m00.0s

running (1m30.9s), 50/50 VUs, 2496 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m30.9s/5m00.0s

running (1m31.9s), 50/50 VUs, 2524 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m31.9s/5m00.0s

running (1m32.9s), 50/50 VUs, 2557 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m32.9s/5m00.0s

running (1m33.9s), 50/50 VUs, 2588 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m33.9s/5m00.0s

running (1m34.9s), 50/50 VUs, 2619 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m34.9s/5m00.0s

running (1m35.9s), 50/50 VUs, 2648 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m35.9s/5m00.0s

running (1m36.9s), 50/50 VUs, 2674 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m36.9s/5m00.0s

running (1m37.9s), 50/50 VUs, 2714 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m37.9s/5m00.0s

running (1m38.9s), 50/50 VUs, 2742 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m38.9s/5m00.0s

running (1m39.9s), 50/50 VUs, 2777 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m39.9s/5m00.0s

running (1m40.9s), 50/50 VUs, 2808 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m40.9s/5m00.0s

running (1m41.9s), 50/50 VUs, 2834 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m41.9s/5m00.0s

running (1m42.9s), 50/50 VUs, 2852 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m42.9s/5m00.0s

running (1m43.9s), 50/50 VUs, 2883 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m43.9s/5m00.0s

running (1m44.9s), 50/50 VUs, 2911 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m44.9s/5m00.0s

running (1m45.9s), 50/50 VUs, 2947 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m45.9s/5m00.0s

running (1m46.9s), 50/50 VUs, 2978 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m46.9s/5m00.0s

running (1m47.9s), 50/50 VUs, 3001 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m47.9s/5m00.0s

running (1m48.9s), 50/50 VUs, 3038 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m48.9s/5m00.0s

running (1m49.9s), 50/50 VUs, 3072 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m49.9s/5m00.0s

running (1m50.9s), 50/50 VUs, 3109 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m50.9s/5m00.0s

running (1m51.9s), 50/50 VUs, 3149 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m51.9s/5m00.0s

running (1m52.9s), 50/50 VUs, 3187 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m52.9s/5m00.0s

running (1m53.9s), 50/50 VUs, 3223 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m53.9s/5m00.0s

running (1m54.9s), 50/50 VUs, 3261 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m54.9s/5m00.0s

running (1m55.9s), 50/50 VUs, 3303 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m55.9s/5m00.0s

running (1m56.9s), 50/50 VUs, 3339 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m56.9s/5m00.0s

running (1m57.9s), 50/50 VUs, 3376 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m57.9s/5m00.0s

running (1m58.9s), 50/50 VUs, 3411 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m58.9s/5m00.0s

running (1m59.9s), 50/50 VUs, 3451 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m59.9s/5m00.0s

running (2m00.9s), 50/50 VUs, 3494 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  2m00.9s/5m00.0s

running (2m01.9s), 50/50 VUs, 3526 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m01.9s/5m00.0s

running (2m02.9s), 50/50 VUs, 3566 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m02.9s/5m00.0s

running (2m03.9s), 50/50 VUs, 3600 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m03.9s/5m00.0s

running (2m04.9s), 50/50 VUs, 3621 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m04.9s/5m00.0s

running (2m05.9s), 50/50 VUs, 3652 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m05.9s/5m00.0s

running (2m06.9s), 50/50 VUs, 3686 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m06.9s/5m00.0s

running (2m07.9s), 50/50 VUs, 3713 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m07.9s/5m00.0s

running (2m08.9s), 50/50 VUs, 3752 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m08.9s/5m00.0s

running (2m09.9s), 50/50 VUs, 3769 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m09.9s/5m00.0s

running (2m10.9s), 50/50 VUs, 3798 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m10.9s/5m00.0s

running (2m11.9s), 50/50 VUs, 3823 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m11.9s/5m00.0s

running (2m12.9s), 50/50 VUs, 3860 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m12.9s/5m00.0s

running (2m13.9s), 50/50 VUs, 3896 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m13.9s/5m00.0s

running (2m15.0s), 50/50 VUs, 3910 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m15.0s/5m00.0s

running (2m15.9s), 50/50 VUs, 3942 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m15.9s/5m00.0s

running (2m16.9s), 50/50 VUs, 3983 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m16.9s/5m00.0s

running (2m17.9s), 50/50 VUs, 4017 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m17.9s/5m00.0s

running (2m18.9s), 50/50 VUs, 4049 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m18.9s/5m00.0s

running (2m19.9s), 50/50 VUs, 4073 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m19.9s/5m00.0s

running (2m20.9s), 50/50 VUs, 4120 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m20.9s/5m00.0s

running (2m21.9s), 50/50 VUs, 4143 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m21.9s/5m00.0s

running (2m22.9s), 50/50 VUs, 4186 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m22.9s/5m00.0s

running (2m23.9s), 50/50 VUs, 4228 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m23.9s/5m00.0s

running (2m24.9s), 50/50 VUs, 4267 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m24.9s/5m00.0s

running (2m25.9s), 50/50 VUs, 4316 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m25.9s/5m00.0s

running (2m26.9s), 50/50 VUs, 4349 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m26.9s/5m00.0s

running (2m27.9s), 50/50 VUs, 4388 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m27.9s/5m00.0s

running (2m28.9s), 50/50 VUs, 4413 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m28.9s/5m00.0s

running (2m29.9s), 50/50 VUs, 4453 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m29.9s/5m00.0s

running (2m30.9s), 50/50 VUs, 4479 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m30.9s/5m00.0s

running (2m31.9s), 50/50 VUs, 4522 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m31.9s/5m00.0s

running (2m32.9s), 50/50 VUs, 4558 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m32.9s/5m00.0s

running (2m33.9s), 50/50 VUs, 4607 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m33.9s/5m00.0s

running (2m34.9s), 50/50 VUs, 4652 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m34.9s/5m00.0s

running (2m35.9s), 50/50 VUs, 4681 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m35.9s/5m00.0s

running (2m36.9s), 50/50 VUs, 4724 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m36.9s/5m00.0s

running (2m37.9s), 50/50 VUs, 4763 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m37.9s/5m00.0s

running (2m38.9s), 50/50 VUs, 4799 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m38.9s/5m00.0s

running (2m39.9s), 50/50 VUs, 4842 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m39.9s/5m00.0s

running (2m40.9s), 50/50 VUs, 4868 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m40.9s/5m00.0s

running (2m41.9s), 50/50 VUs, 4901 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m41.9s/5m00.0s

running (2m42.9s), 50/50 VUs, 4947 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m42.9s/5m00.0s

running (2m43.9s), 50/50 VUs, 4978 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m43.9s/5m00.0s

running (2m44.9s), 50/50 VUs, 5024 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m44.9s/5m00.0s

running (2m45.9s), 50/50 VUs, 5045 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m45.9s/5m00.0s

running (2m46.9s), 50/50 VUs, 5086 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m46.9s/5m00.0s

running (2m47.9s), 50/50 VUs, 5131 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m47.9s/5m00.0s

running (2m48.9s), 50/50 VUs, 5171 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m48.9s/5m00.0s

running (2m49.9s), 50/50 VUs, 5217 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m49.9s/5m00.0s

running (2m50.9s), 50/50 VUs, 5255 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m50.9s/5m00.0s

running (2m51.9s), 50/50 VUs, 5300 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m51.9s/5m00.0s

running (2m52.9s), 50/50 VUs, 5350 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m52.9s/5m00.0s

running (2m53.9s), 50/50 VUs, 5387 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m53.9s/5m00.0s

running (2m54.9s), 50/50 VUs, 5429 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m54.9s/5m00.0s

running (2m55.9s), 50/50 VUs, 5467 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m55.9s/5m00.0s

running (2m56.9s), 50/50 VUs, 5516 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m56.9s/5m00.0s

running (2m57.9s), 50/50 VUs, 5557 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m57.9s/5m00.0s

running (2m58.9s), 50/50 VUs, 5593 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m58.9s/5m00.0s

running (2m59.9s), 50/50 VUs, 5622 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m59.9s/5m00.0s

running (3m00.9s), 50/50 VUs, 5662 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  3m00.9s/5m00.0s

running (3m01.9s), 50/50 VUs, 5712 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m01.9s/5m00.0s

running (3m02.9s), 50/50 VUs, 5749 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m02.9s/5m00.0s

running (3m03.9s), 50/50 VUs, 5795 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m03.9s/5m00.0s

running (3m04.9s), 50/50 VUs, 5841 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m04.9s/5m00.0s

running (3m05.9s), 50/50 VUs, 5888 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m05.9s/5m00.0s

running (3m06.9s), 50/50 VUs, 5929 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m06.9s/5m00.0s

running (3m07.9s), 50/50 VUs, 5978 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m07.9s/5m00.0s

running (3m08.9s), 50/50 VUs, 6014 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m08.9s/5m00.0s

running (3m09.9s), 50/50 VUs, 6057 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m09.9s/5m00.0s

running (3m10.9s), 50/50 VUs, 6105 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m10.9s/5m00.0s

running (3m11.9s), 50/50 VUs, 6131 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m11.9s/5m00.0s

running (3m12.9s), 50/50 VUs, 6173 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m12.9s/5m00.0s

running (3m13.9s), 50/50 VUs, 6222 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m13.9s/5m00.0s

running (3m14.9s), 50/50 VUs, 6272 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m14.9s/5m00.0s

running (3m15.9s), 50/50 VUs, 6309 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m15.9s/5m00.0s

running (3m16.9s), 50/50 VUs, 6349 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m16.9s/5m00.0s

running (3m17.9s), 50/50 VUs, 6395 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m17.9s/5m00.0s

running (3m18.9s), 50/50 VUs, 6425 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m18.9s/5m00.0s

running (3m19.9s), 50/50 VUs, 6473 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m19.9s/5m00.0s

running (3m20.9s), 50/50 VUs, 6506 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m20.9s/5m00.0s

running (3m21.9s), 50/50 VUs, 6546 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m21.9s/5m00.0s

running (3m22.9s), 50/50 VUs, 6594 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m22.9s/5m00.0s

running (3m23.9s), 50/50 VUs, 6632 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m23.9s/5m00.0s

running (3m24.9s), 50/50 VUs, 6662 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m24.9s/5m00.0s

running (3m25.9s), 50/50 VUs, 6707 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m25.9s/5m00.0s

running (3m26.9s), 50/50 VUs, 6753 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m26.9s/5m00.0s

running (3m27.9s), 50/50 VUs, 6787 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m27.9s/5m00.0s

running (3m28.9s), 50/50 VUs, 6834 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m28.9s/5m00.0s

running (3m29.9s), 50/50 VUs, 6881 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m29.9s/5m00.0s

running (3m30.9s), 50/50 VUs, 6925 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m30.9s/5m00.0s

running (3m31.9s), 50/50 VUs, 6964 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m31.9s/5m00.0s

running (3m32.9s), 50/50 VUs, 7013 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m32.9s/5m00.0s

running (3m33.9s), 50/50 VUs, 7046 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m33.9s/5m00.0s

running (3m34.9s), 50/50 VUs, 7085 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m34.9s/5m00.0s

running (3m35.9s), 50/50 VUs, 7132 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m35.9s/5m00.0s

running (3m36.9s), 50/50 VUs, 7163 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m36.9s/5m00.0s

running (3m37.9s), 50/50 VUs, 7206 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m37.9s/5m00.0s

running (3m38.9s), 50/50 VUs, 7255 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m38.9s/5m00.0s

running (3m39.9s), 50/50 VUs, 7302 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m39.9s/5m00.0s

running (3m40.9s), 50/50 VUs, 7341 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m40.9s/5m00.0s

running (3m41.9s), 50/50 VUs, 7385 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m41.9s/5m00.0s

running (3m42.9s), 50/50 VUs, 7421 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m42.9s/5m00.0s

running (3m43.9s), 50/50 VUs, 7469 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m43.9s/5m00.0s

running (3m44.9s), 50/50 VUs, 7509 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m44.9s/5m00.0s

running (3m45.9s), 50/50 VUs, 7553 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m45.9s/5m00.0s

running (3m46.9s), 50/50 VUs, 7602 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m46.9s/5m00.0s

running (3m47.9s), 50/50 VUs, 7649 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m47.9s/5m00.0s

running (3m48.9s), 50/50 VUs, 7675 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m48.9s/5m00.0s

running (3m49.9s), 50/50 VUs, 7714 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m49.9s/5m00.0s

running (3m50.9s), 50/50 VUs, 7762 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m50.9s/5m00.0s

running (3m51.9s), 50/50 VUs, 7786 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m51.9s/5m00.0s

running (3m52.9s), 50/50 VUs, 7827 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m52.9s/5m00.0s

running (3m53.9s), 50/50 VUs, 7873 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m53.9s/5m00.0s

running (3m54.9s), 50/50 VUs, 7907 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m54.9s/5m00.0s

running (3m55.9s), 50/50 VUs, 7957 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m55.9s/5m00.0s

running (3m56.9s), 50/50 VUs, 7985 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m56.9s/5m00.0s

running (3m57.9s), 50/50 VUs, 8017 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m57.9s/5m00.0s

running (3m58.9s), 50/50 VUs, 8057 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  3m58.9s/5m00.0s

running (3m59.9s), 50/50 VUs, 8093 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  3m59.9s/5m00.0s

running (4m00.9s), 50/50 VUs, 8129 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  4m00.9s/5m00.0s

running (4m01.9s), 50/50 VUs, 8174 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m01.9s/5m00.0s

running (4m02.9s), 50/50 VUs, 8207 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m02.9s/5m00.0s

running (4m03.9s), 50/50 VUs, 8242 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m03.9s/5m00.0s

running (4m04.9s), 50/50 VUs, 8273 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m04.9s/5m00.0s

running (4m05.9s), 50/50 VUs, 8320 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m05.9s/5m00.0s

running (4m06.9s), 50/50 VUs, 8353 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m06.9s/5m00.0s

running (4m07.9s), 50/50 VUs, 8398 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m07.9s/5m00.0s

running (4m08.9s), 50/50 VUs, 8434 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m08.9s/5m00.0s

running (4m09.9s), 50/50 VUs, 8465 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m09.9s/5m00.0s

running (4m10.9s), 50/50 VUs, 8508 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m10.9s/5m00.0s

running (4m11.9s), 50/50 VUs, 8538 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m11.9s/5m00.0s

running (4m12.9s), 50/50 VUs, 8556 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m12.9s/5m00.0s

running (4m13.9s), 50/50 VUs, 8602 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m13.9s/5m00.0s

running (4m14.9s), 50/50 VUs, 8651 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m14.9s/5m00.0s

running (4m15.9s), 50/50 VUs, 8696 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m15.9s/5m00.0s

running (4m16.9s), 50/50 VUs, 8725 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m16.9s/5m00.0s

running (4m17.9s), 50/50 VUs, 8774 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m17.9s/5m00.0s

running (4m18.9s), 50/50 VUs, 8806 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m18.9s/5m00.0s

running (4m19.9s), 50/50 VUs, 8845 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m19.9s/5m00.0s

running (4m20.9s), 50/50 VUs, 8886 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m20.9s/5m00.0s

running (4m21.9s), 50/50 VUs, 8922 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m21.9s/5m00.0s

running (4m22.9s), 50/50 VUs, 8957 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m22.9s/5m00.0s

running (4m23.9s), 50/50 VUs, 8999 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m23.9s/5m00.0s

running (4m24.9s), 50/50 VUs, 9032 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m24.9s/5m00.0s

running (4m25.9s), 50/50 VUs, 9065 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m25.9s/5m00.0s

running (4m26.9s), 50/50 VUs, 9100 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m26.9s/5m00.0s

running (4m27.9s), 50/50 VUs, 9139 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m27.9s/5m00.0s

running (4m28.9s), 50/50 VUs, 9173 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m28.9s/5m00.0s

running (4m29.9s), 50/50 VUs, 9217 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m29.9s/5m00.0s

running (4m30.9s), 50/50 VUs, 9233 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m30.9s/5m00.0s

running (4m31.9s), 49/50 VUs, 9266 complete and 0 interrupted iterations
default   [  91% ] 49/50 VUs  4m31.9s/5m00.0s

running (4m32.9s), 48/50 VUs, 9294 complete and 0 interrupted iterations
default   [  91% ] 48/50 VUs  4m32.9s/5m00.0s

running (4m33.9s), 45/50 VUs, 9341 complete and 0 interrupted iterations
default   [  91% ] 45/50 VUs  4m33.9s/5m00.0s

running (4m34.9s), 44/50 VUs, 9365 complete and 0 interrupted iterations
default   [  92% ] 44/50 VUs  4m34.9s/5m00.0s

running (4m35.9s), 42/50 VUs, 9406 complete and 0 interrupted iterations
default   [  92% ] 42/50 VUs  4m35.9s/5m00.0s

running (4m36.9s), 40/50 VUs, 9435 complete and 0 interrupted iterations
default   [  92% ] 40/50 VUs  4m36.9s/5m00.0s

running (4m37.9s), 38/50 VUs, 9473 complete and 0 interrupted iterations
default   [  93% ] 38/50 VUs  4m37.9s/5m00.0s

running (4m38.9s), 36/50 VUs, 9498 complete and 0 interrupted iterations
default   [  93% ] 36/50 VUs  4m38.9s/5m00.0s

running (4m39.9s), 35/50 VUs, 9529 complete and 0 interrupted iterations
default   [  93% ] 35/50 VUs  4m39.9s/5m00.0s

running (4m40.9s), 33/50 VUs, 9564 complete and 0 interrupted iterations
default   [  94% ] 33/50 VUs  4m40.9s/5m00.0s

running (4m41.9s), 33/50 VUs, 9584 complete and 0 interrupted iterations
default   [  94% ] 33/50 VUs  4m41.9s/5m00.0s

running (4m42.9s), 30/50 VUs, 9612 complete and 0 interrupted iterations
default   [  94% ] 30/50 VUs  4m42.9s/5m00.0s

running (4m43.9s), 28/50 VUs, 9637 complete and 0 interrupted iterations
default   [  95% ] 28/50 VUs  4m43.9s/5m00.0s

running (4m44.9s), 27/50 VUs, 9662 complete and 0 interrupted iterations
default   [  95% ] 27/50 VUs  4m44.9s/5m00.0s

running (4m45.9s), 25/50 VUs, 9688 complete and 0 interrupted iterations
default   [  95% ] 25/50 VUs  4m45.9s/5m00.0s

running (4m46.9s), 23/50 VUs, 9707 complete and 0 interrupted iterations
default   [  96% ] 23/50 VUs  4m46.9s/5m00.0s

running (4m47.9s), 21/50 VUs, 9730 complete and 0 interrupted iterations
default   [  96% ] 21/50 VUs  4m47.9s/5m00.0s

running (4m48.9s), 20/50 VUs, 9751 complete and 0 interrupted iterations
default   [  96% ] 20/50 VUs  4m48.9s/5m00.0s

running (4m49.9s), 18/50 VUs, 9770 complete and 0 interrupted iterations
default   [  97% ] 18/50 VUs  4m49.9s/5m00.0s

running (4m50.9s), 17/50 VUs, 9782 complete and 0 interrupted iterations
default   [  97% ] 17/50 VUs  4m50.9s/5m00.0s

running (4m51.9s), 16/50 VUs, 9795 complete and 0 interrupted iterations
default   [  97% ] 16/50 VUs  4m51.9s/5m00.0s

running (4m52.9s), 13/50 VUs, 9811 complete and 0 interrupted iterations
default   [  98% ] 13/50 VUs  4m52.9s/5m00.0s

running (4m53.9s), 11/50 VUs, 9824 complete and 0 interrupted iterations
default   [  98% ] 11/50 VUs  4m53.9s/5m00.0s

running (4m54.9s), 09/50 VUs, 9833 complete and 0 interrupted iterations
default   [  98% ] 09/50 VUs  4m54.9s/5m00.0s

running (4m55.9s), 08/50 VUs, 9841 complete and 0 interrupted iterations
default   [  99% ] 08/50 VUs  4m55.9s/5m00.0s

running (4m56.9s), 07/50 VUs, 9849 complete and 0 interrupted iterations
default   [  99% ] 07/50 VUs  4m56.9s/5m00.0s

running (4m57.9s), 04/50 VUs, 9856 complete and 0 interrupted iterations
default   [  99% ] 04/50 VUs  4m57.9s/5m00.0s

running (4m58.9s), 04/50 VUs, 9859 complete and 0 interrupted iterations
default   [ 100% ] 04/50 VUs  4m58.9s/5m00.0s

running (4m59.9s), 02/50 VUs, 9862 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  4m59.9s/5m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<200' p(95)=1.09s
    ✗ 'p(99)<500' p(99)=1.76s

    http_req_failed
    ✗ 'rate==0' rate=0.06%


  █ TOTAL RESULTS 

    checks_total.......: 29592  98.476818/s
    checks_succeeded...: 99.93% 29574 out of 29592
    checks_failed......: 0.06%  18 out of 29592

    ✗ status 200
      ↳  99% — ✓ 9858 / ✗ 6
    ✗ verdict present
      ↳  99% — ✓ 9858 / ✗ 6
    ✗ score dans [0,100]
      ↳  99% — ✓ 9858 / ✗ 6

    HTTP
    http_req_duration..............: avg=368.42ms min=16.45ms med=253.48ms max=4.02s p(90)=805.85ms p(95)=1.09s p(99)=1.76s
      { expected_response:true }...: avg=368.59ms min=16.45ms med=253.55ms max=4.02s p(90)=806.03ms p(95)=1.09s p(99)=1.76s
    http_req_failed................: 0.06%  6 out of 9864
    http_reqs......................: 9864   32.825606/s

    EXECUTION
    iteration_duration.............: avg=1.37s    min=1.01s   med=1.25s    max=5.02s p(90)=1.81s    p(95)=2.09s p(99)=2.76s
    iterations.....................: 9864   32.825606/s
    vus............................: 2      min=2         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 19 MB  64 kB/s
    data_sent......................: 2.3 MB 7.5 kB/s



running (5m00.5s), 00/50 VUs, 9864 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  5m0s
time="2026-09-21T02:45:25+01:00" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' have been crossed"
====================================================================
 SLI mesurés côté serveur (Prometheus) — scénario nominal
====================================================================
 fenêtre          : 02:40:24 -> 02:45:25 (301 s)
 requêtes /verify : 10294
 latence P95      : 974 ms
 latence P99      : 1817 ms
 erreurs 5xx      : 0.000 %  (disponibilité 100.000 %)
 cache hit ratio  : 0.0 %  (0 hits / 10291)
 pods API         : 6 prêts, 6 scrapés (une série par pod)
====================================================================